package com.boe.esl.socket;

public class NettyConstant {
	
	/**
	 * 帧头
	 * +-------+------+-------+------+--------+ 
	 * | 协议头 | 版本  | 命令字 | 预留  | 数据长度 |
	 * +-------+------+-------+------+--------+ 
	 * | 1字节  | 1字节 | 1字节 | 1字节 | 1字节   |
	 * +-------+------+-------+------+--------+
	 */
	public static final int HEADER_LENGTH = 5;
	
	/**
	 * 请求Info数据段
	 * +------+-------+-------+-------+------+------+--------+---------+------+
	 * | Mac  | 品名   | 产地   | 规格  | 等级  | 单位  | 商品编码 | 促销时间 | 价格  |
	 * |------+-------+-------+-------+------+------+--------+---------+------+
	 * | 6字节 | 30字节 | 12字节 | 6字节 | 6字节 | 6字节 | 6字节   | 16字节  | 8字节 | 
	 * +------+-------+-------+-------+------+------+--------+---------+------+
	 */
	public static final int REQ_INFO_LENGTH = 6 + 30 + 12 + 6 + 6 + 6 + 6 + 16 + 8;
	
	/**
	 * 响应Info数据帧
	 * +-------+--------+
	 * | 状态码 | Mac地址 |
	 * +-------+--------+
	 * | 1字节  | 6字节   |
	 * +-------+--------+
	 */
	public static final int RESP_INFO_LENGTH = 1 + 6;
	
	/**
	 * 请求Register数据帧
	 * +--------+----------+
	 * | 网关名  | 注册码MD5 |
	 * +--------+----------+
	 * | 8字节   | 32字节   |
	 * +--------+----------+
	 */
	public static final int REQ_REGISTER_LENGTH = 8 + 32;
	
	/**
	 * Register/Awake/Update/Cancel/Done：响应数据帧基础长度
	 * +-------+
	 * | 状态码 |
	 * +-------+
	 * | 1字节  |
	 * +-------+
	 */
	public static final int RESP_REGISTER_BASE_LENGTH = 1;

	public static final int REQ_UPDATE_LENGTH = 48;
	/**
	 * 请求控制数据帧
	 * +--------+----------+---------------+
	 * | 设备类型 | 设备ID   |  控制码        |
	 * +--------+----------+---------------+
	 * | 1字节   |  8字节   |    1字节       |
	 * +--------+----------+---------------+
	 */
	public static final int REQ_CONTROL_LENGTH=10;
}
